#+TITLE: Organize My Life In Plain Text
#+AUTHOR: HUCHEN

* Tasks 
  
** DONE 海龟策略在 TB 平台的撰写
   CLOSED: [2017-12-23 周六 16:10]
   :PROPERTIES:
   :LAST_REPEAT: [2017-12-23 周六 16:10]
   :END:
   - State "DONE"       from "NEXT"       [2017-12-23 周六 16:10]
   :LOGBOOK:
   CLOCK: [2017-12-23 周六 15:52]--[2017-12-23 周六 16:09] =>  0:17
   CLOCK: [2017-12-23 周六 15:22]--[2017-12-23 周六 15:47] =>  0:25
   CLOCK: [2017-12-23 周六 14:51]--[2017-12-23 周六 15:16] =>  0:25
   CLOCK: [2017-12-22 周五 17:45]--[2017-12-22 周五 18:10] =>  0:25
   CLOCK: [2017-12-22 周五 17:14]--[2017-12-22 周五 17:39] =>  0:25
   CLOCK: [2017-12-22 周五 16:13]--[2017-12-22 周五 16:38] =>  0:25
   CLOCK: [2017-12-21 周四 15:57]--[2017-12-21 周四 16:22] =>  0:25
   CLOCK: [2017-12-21 周四 15:27]--[2017-12-21 周四 15:52] =>  0:25
   :END:

** NEXT 海龟策略差异对比
   SCHEDULED: <2017-12-27 周三 14:50>
   :LOGBOOK:
   CLOCK: [2017-12-27 周三 15:50]--[2017-12-27 周三 16:15] =>  0:25
   CLOCK: [2017-12-27 周三 15:20]--[2017-12-27 周三 15:45] =>  0:25
   CLOCK: [2017-12-27 周三 14:50]--[2017-12-27 周三 15:15] =>  0:25
   :END:
** NEXT =RTS= 策略在 TB 旗舰版与极速版差异对比
   :LOGBOOK:
   CLOCK: [2017-12-24 周日 16:03]--[2017-12-24 周日 16:28] =>  0:25
   :END:
   
* Projects
  
** NEXT 资管计划
   
*** DONE 初步计划 -- 确定使用平台
    CLOSED: [2017-12-11 周一 15:20]
    - 使用掘金平台
    - 投资标的为 股票、期货
    - 固定止损 5%
    - 分成比例与一般私募机构类似
      
*** DONE 简单双均线策略
    CLOSED: [2017-12-21 周四 15:26]
*** DONE 双均线策略加止损实现
    CLOSED: [2017-12-21 周四 15:26]
*** DONE =on_tick= 上实现双均线策略的止损
    CLOSED: [2017-12-22 周五 10:18]
    :PROPERTIES:
    :LAST_REPEAT: [2017-12-22 周五 10:18]
    :END:
    - State "DONE"       from "NEXT"       [2017-12-22 周五 10:18]
    :LOGBOOK:
    CLOCK: [2017-12-22 周五 09:29]--[2017-12-22 周五 09:54] =>  0:25
    CLOCK: [2017-12-21 周四 21:45]--[2017-12-21 周四 22:10] =>  0:25
    CLOCK: [2017-12-21 周四 21:04]--[2017-12-21 周四 21:29] =>  0:25
    CLOCK: [2017-12-21 周四 20:09]--[2017-12-21 周四 20:34] =>  0:25
    CLOCK: [2017-12-21 周四 19:39]--[2017-12-21 周四 20:04] =>  0:25
    CLOCK: [2017-12-21 周四 19:01]--[2017-12-21 周四 19:26] =>  0:25
    :END:
*** DONE 双均线策略考虑 =on_bar= 与 =on_tick= 执行顺序
    CLOSED: [2017-12-24 周日 15:40]
    :LOGBOOK:
    CLOCK: [2017-12-24 周日 14:30]--[2017-12-24 周日 15:35] =>  1:05
    CLOCK: [2017-12-24 周日 14:00]--[2017-12-24 周日 14:25] =>  0:25
    CLOCK: [2017-12-24 周日 13:30]--[2017-12-24 周日 13:55] =>  0:25
    CLOCK: [2017-12-24 周日 00:15]--[2017-12-24 周日 00:28] =>  0:13
    CLOCK: [2017-12-23 周六 23:39]--[2017-12-24 周日 00:04] =>  0:25
    :END:
*** DONE 双均线策略考虑指数止损
    CLOSED: [2017-12-26 周二 21:17] SCHEDULED: <2017-12-26 周二 20:00>
    :LOGBOOK:
    CLOCK: [2017-12-26 周二 15:44]--[2017-12-26 周二 16:09] =>  0:25
    :END:
*** DONE 双均线策略加入指数止损加上 KDJ 过滤
    CLOSED: [2017-12-28 周四 13:02]
    :LOGBOOK:
    CLOCK: [2017-12-27 周三 13:31]--[2017-12-27 周三 13:56] =>  0:25
    :END:
*** NEXT 海龟交易法
    SCHEDULED: <2017-12-28 周四 13:00>
    :LOGBOOK:
    CLOCK: [2017-12-28 周四 14:06]--[2017-12-28 周四 15:11] =>  1:05
    CLOCK: [2017-12-28 周四 13:36]--[2017-12-28 周四 14:01] =>  0:25
    CLOCK: [2017-12-28 周四 13:04]--[2017-12-28 周四 13:30] =>  0:26
    :END:
** WAITING 遗传算法在技术指标结合中的应用实践                      :WAITING:
** TODO 南师大学报论文发表
 
*** WAITING 程序化交易 -- 以心理线指标为例                          :WAITING:
    SCHEDULED: <2017-12-26 周二 12:30>
    :LOGBOOK:
    CLOCK: [2017-12-26 周二 11:51]--[2017-12-26 周二 12:16] =>  0:25
    CLOCK: [2017-12-26 周二 11:20]--[2017-12-26 周二 11:45] =>  0:25
    CLOCK: [2017-12-25 周一 13:29]--[2017-12-25 周一 13:54] =>  0:25
    CLOCK: [2017-12-25 周一 12:59]--[2017-12-25 周一 13:24] =>  0:25
    CLOCK: [2017-12-25 周一 12:25]--[2017-12-25 周一 12:50] =>  0:25
    CLOCK: [2017-12-24 周日 20:44]--[2017-12-24 周日 21:09] =>  0:25
    CLOCK: [2017-12-24 周日 20:11]--[2017-12-24 周日 20:36] =>  0:25
    CLOCK: [2017-12-24 周日 19:41]--[2017-12-24 周日 20:06] =>  0:25
    :END:
    - [X] 版本一：初始格式，参考文献
    - [X] 版本二：图片调整，代码调整
    - [X] 投稿
    - [ ] 稿件修改

*** NEXT K-means 聚类算法在股票上的建模应用
    SCHEDULED: <2017-12-26 周二 16:00 +1d>
    :LOGBOOK:
    CLOCK: [2017-12-29 周五 16:00]--[2017-12-29 周五 16:25] =>  0:25
    CLOCK: [2017-12-25 周一 16:04]--[2017-12-25 周一 16:30] =>  0:26
    :END:
    
*** TODO 反应趋势交易系统
** NEXT MxNet Learning
   SCHEDULED: <2017-12-28 周四 17:30>
   :LOGBOOK:
   CLOCK: [2017-12-28 周四 17:24]--[2017-12-28 周四 17:49] =>  0:25
   :END:
* Miscellaneous
  
** TODOs
** Response
   
* Habits
  
** NEXT =TradeBlazer= 策略编写
   SCHEDULED: <2018-01-15 周一 14:00>
   :PROPERTIES:
   :Effort:   60
   :END:
   :LOGBOOK:
   CLOCK: [2018-01-17 周三 15:35]--[2018-01-17 周三 16:00] =>  0:25
   CLOCK: [2018-01-17 周三 15:05]--[2018-01-17 周三 15:30] =>  0:25
   CLOCK: [2018-01-15 周一 15:36]--[2018-01-16 周二 08:46] => 17:10
   CLOCK: [2018-01-15 周一 14:30]--[2018-01-15 周一 14:55] =>  0:25
   :END:
   1. 海龟策略止损改进
   2. 网格交易改进
   3. =RTS= 中趋势交易分形实现
   4. 洛氏霍克交易法

** NEXT MxNet 学习
   SCHEDULED: <2018-01-15 周一 13:00>
   :PROPERTIES:
   :Effort:   60
   :END:
   :LOGBOOK:
   CLOCK: [2018-01-17 周三 16:42]--[2018-01-17 周三 17:21] =>  0:39
   CLOCK: [2018-01-17 周三 16:16]--[2018-01-17 周三 16:27] =>  0:11
   CLOCK: [2018-01-15 周一 13:51]--[2018-01-15 周一 14:16] =>  0:25
   CLOCK: [2018-01-15 周一 13:16]--[2018-01-15 周一 13:41] =>  0:25
   CLOCK: [2018-01-15 周一 12:46]--[2018-01-15 周一 13:11] =>  0:25
   :END:

** NEXT 掘金量化策略编写
   SCHEDULED: <2018-01-17 周三 15:00>
   :LOGBOOK:
   CLOCK: [2018-01-16 周二 17:02]--[2018-01-16 周二 18:00] =>  0:58
   CLOCK: [2018-01-16 周二 16:32]--[2018-01-16 周二 16:57] =>  0:25
   CLOCK: [2018-01-16 周二 16:02]--[2018-01-16 周二 16:27] =>  0:25
   CLOCK: [2018-01-16 周二 14:49]--[2018-01-16 周二 15:14] =>  0:25
   :END:

** QuantOS 策略编写
